update mermaid flow diagram
